//Задание 6
//Создайте переменные – ДвухзначноеЧисло и Степень. Присвойте им определенные целочисленные значения.
//Обеспечьте возведение ДвухзначногоЧисла в Степень. Далее, нужно сообщить получившийся результат.
//Также нужно сообщить превышает ли полученное значение 10 000.

Перем ДвухзначноеЧисло, Степень;
ДвухзначноеЧисло = 11;
Степень = 0;
Результат = 1;

Для Счетчик = 1 по Степень Цикл
	
	Результат = Результат*ДвухзначноеЧисло;

КонецЦикла;

Сообщить(Результат);

Если Результат>10000 Тогда
	
	Сообщить("Превышает 10000");
	
Иначе
	
	Сообщить ("Не превышает 10000");
	
КонецЕсли;

//Сообщить(Pow(ДвухзначноеЧисло, Степень));

//Задание 7
//Сообщите на какой день недели выпадает 31 декабря в ближайшие 10 лет.
//Название дня недели нужно выдать в текстовом виде, например – понедельник, вторник, …
//Подсказка. Для определения дня недели используйте встроенную функцию ДеньНедели.
Дата1 = КонецГода(ТекущаяДата());

Для Число = 1 по 10 Цикл
Если (ДеньНедели(Дата1))=1 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Понедельник");
КонецЕсли;
Если (ДеньНедели(Дата1))=2 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Вторник");
КонецЕсли;
Если (ДеньНедели(Дата1))=3 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Среда");
КонецЕсли;
Если (ДеньНедели(Дата1))=4 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Четверг");
КонецЕсли;
Если (ДеньНедели(Дата1))=5 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Пятница");
КонецЕсли;
Если (ДеньНедели(Дата1))=6 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Суббота");
КонецЕсли;
Если (ДеньНедели(Дата1))=7 Тогда
	Сообщить(Строка(Год(Дата1))+" год 31 декабря -это "+"Воскресенье");
КонецЕсли;
Дата1=КонецГода(Дата1+1);
КонецЦикла;