
Функция ОстатокПоСчету (Счет, Период)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрБухгалтерииПоБухУчетуОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
		|	РегистрБухгалтерииПоБухУчетуОстатки.СуммаОстатокКт КАК СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрБухгалтерииПоБухУчету.Остатки(&Период, Счет = &Счет, ) КАК РегистрБухгалтерииПоБухУчетуОстатки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Счет", Счет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Если Счет.Вид = ВидСчета.Активный Тогда
		Возврат ВыборкаДетальныеЗаписи.СуммаОстатокДт;
	Иначе
		Возврат ВыборкаДетальныеЗаписи.СуммаОстатоккт;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	КонецПериода = КонецМесяца(Дата)+1;
	ОстатокВыручка = ОстатокПоСчету(ПланыСчетов.БухУчет.Выручка, КонецПериода);
	ОстатокСебестоимость = ОстатокПоСчету(ПланыСчетов.БухУчет.Себестоимость, КонецПериода);

	Движения.РегистрБухгалтерииПоБухУчету.Записывать = Истина;
	
	Движение = Движения.РегистрБухгалтерииПоБухУчету.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.БухУчет.Выручка;
	Движение.СчетКт = ПланыСчетов.БухУчет.Прибыль;
	Движение.Сумма = ОстатокВыручка;

	Движение = Движения.РегистрБухгалтерииПоБухУчету.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.БухУчет.Прибыль;
	Движение.СчетКт = ПланыСчетов.БухУчет.Себестоимость;
	Движение.Сумма = ОстатокСебестоимость;

	
КонецПроцедуры
