
Процедура ПрошелТестНаАдминистрирование1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрошелТестНаАдминистрирование1С; 
КонецПроцедуры

Процедура ПрошелТестНаПрограммированиеВ1СПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПрошелТестНаПрограммирование1С;
КонецПроцедуры


Процедура ВакансияОператораПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Оператор;
КонецПроцедуры


Процедура ВакансияАдминистратора1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Администратор;

КонецПроцедуры


Процедура ВакансияПрограммиста1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Перечисления.Вакансия.Программист;
КонецПроцедуры

