
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
		Если ТекущиеДанныеТовары.Количество = 0 Тогда
		ТекущиеДанныеТовары.Цена = 0;
		ТекущиеДанныеТовары.Сумма = 0;
	Иначе	
		ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Цена * ТекущиеДанныеТовары.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанныеТовары.Сумма = ТекущиеДанныеТовары.Цена * ТекущиеДанныеТовары.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекущиеДанныеТовары = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТовары.Количество = 0 Тогда
		ТекущиеДанныеТовары.Цена = 0;
	Иначе
		ТекущиеДанныеТовары.Цена = ТекущиеДанныеТовары.Сумма / ТекущиеДанныеТовары.Количество;
	КонецЕсли;	
КонецПроцедуры
