
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//Задание 8
//При записи документа «Реализация товаров» сохраните общую сумму документа в реквизит «Сумма документа».
//Также необходимо выполнить проверку, что в документе «Реализация товаров» выбран контрагент, у которого указан флаг «Клиент».
//Подсказка 1. Для проверки корректности заполнения реквизитов используйте событие ОбработкаПроверкиЗаполнения.
//Подсказка 2. Чтобы получить значение реквизита обращайтесь через «точку». Например, Сообщить(Контрагент.ЭтоКлиент).

Процедура ПриЗаписи(Отказ)
	СуммаДокумента=0;
	Для каждого СтрокаТЧ ИЗ Товары Цикл
		СуммаДокумента = СуммаДокумента + СтрокаТЧ.Сумма;
	КонецЦикла;
	//СуммаДокумента = Товары.Итог("Сумма"); - упрощенный вариант из примера
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Если Контрагент.Клиент = Истина Тогда
	//	Отказ=Ложь;
	//	Сообщить("верно");
	//Иначе 
	//	Отказ = Истина;
	//	Сообщить("неверно");
	//КонецЕсли;
	//Правильно:
	Если НЕ Контрагент.Клиент Тогда
		Отказ=Истина;
		Сообщить("В документе должен быть выбран клиент!");
	КонецЕсли;
КонецПроцедуры



